# Series DataFrame Panel

In [4]:
import pandas as pd
import numpy as np

### Series

##### Series from list and numpy

In [2]:
data = [15,12.5,'Ksb',22,"Jim"]

In [3]:
ps = pd.Series(data)

0      15
1    12.5
2     Ksb
3      22
4     Jim
dtype: object

In [5]:
ndata = np.array(data)

array(['15', '12.5', 'Ksb', '22', 'Jim'], dtype='<U32')

In [6]:
pd.Series(ndata)

0      15
1    12.5
2     Ksb
3      22
4     Jim
dtype: object

##### Series กำหนด index

In [7]:
data = [1,2,3,4,5,6]
idx = ['a','b','c','d','e','f']

In [8]:
pd.Series(data , index=idx)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [9]:
pd.Series(np.array(data) , index = idx)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32

### DataFrame

In [17]:
data = [1,2,3,4,5]
colmns = ['Number']
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [18]:
pd.DataFrame(data , columns= colmns)

   Number
0       1
1       2
2       3
3       4
4       5

In [20]:
list01 = [1,2,3,4,5]
list02 = ['a','b','c','d','e']
colmns = ['Number','Alphabet']
data = list(zip(list01,list02))

In [21]:
pd.DataFrame(data , columns= colmns)

   Number Alphabet
0       1        a
1       2        b
2       3        c
3       4        d
4       5        e

In [57]:
datas = [{'Name':'Somkiat' , 'Age': 20 , 'Score':50},
         {'Name':'Dumrong','Age':30,'Score':69}]

In [64]:
pd.DataFrame(datas ,index= [x for x in [1,2]])

      Name  Age  Score
1  Somkiat   20     50
2  Dumrong   30     69

##### การสร้าง data frame จาก matrix

In [32]:
data = [[1,2,3,4],
        [5,6,7,8],
        [7,8,9,10]]
colmns = ['a','b','c','d']
index = ['First','Second','Third']

In [33]:
pd.DataFrame(data , columns= colmns , index= index)

        a  b  c   d
First   1  2  3   4
Second  5  6  7   8
Third   7  8  9  10

#### การแทนที่ index

In [43]:
data = [['Wasan',18,177],['Prayuth',80,101],['Gojo',20,200]]
cols = ['Name','Age','Height']

In [47]:
df = pd.DataFrame(data, columns= cols)

      Name  Age  Height
0    Wasan   18     177
1  Prayuth   80     101
2     Gojo   20     200

In [45]:
df.set_index(['Name'] , inplace=True)

In [46]:
df

         Age  Height
Name
Wasan     18     177
Prayuth   80     101
Gojo      20     200

#### การสร้าง DataFrame จาก Series

Series -> Dict -> DataFrame

In [53]:
A = pd.Series([1,2,3,4,5,6])
B = pd.Series(['a','b','c','d','c','d'])

In [54]:
frame = {'Number':A,'Alphabet':B}

In [55]:
pd.DataFrame(frame, index=[1,2,3,4,5])

   Number Alphabet
1       2        b
2       3        c
3       4        d
4       5        c
5       6        d

#### Saving as CSV

.to_csv(filepath , index =True or False , header = True or False)

In [79]:
C = pd.DataFrame(frame, index=[1,2,3,4,5])

   Number Alphabet
1       2        b
2       3        c
3       4        d
4       5        c
5       6        d

In [70]:
filepath = 'mydata.csv'
C.to_csv(filepath)

In [78]:
pd.read_csv('mydata.csv')

   Unnamed: 0  Number Alphabet
0           1       2        b
1           2       3        c
2           3       4        d
3           4       5        c
4           5       6        d

In [86]:
cols = ['Alphabet']
filepath = 'data02.csv'
C.to_csv(filepath , columns= cols , index= False)
pd.read_csv('data02.csv')

  Alphabet
0        b
1        c
2        d
3        c
4        d